// ----------NAMES----------

const names = [
  "Олександр",
  "Анна",
  "Олексій",
  "Аліса",
  "Андрій",
  "Ангеліна",
  "Артем",
  "Валерія",
  "Іванна",
  "Дмитро",
  "Дарина",
  "Євген",
  "Катерина",
  "Жанна",
  "Ірина",
  "Іван",
  "Інесса",
  "Костянтин",
  "Крістіна",
  "Карина",
  "Микола",
  "Наталія",
  "Олег",
  "Ольга",
  "Роман",
  "Сергій",
  "Софія",
  "Тетяна",
  "Шарлотта",
  "Ельза",
  "Юлія",
  "Антон",
  "Вероніка",
  "Оксана",
  "Ігор",
  "Єлизавета",
  "Максим",
  "Світлана",
  "Денис",
  "Вікторія",
  "Мілана",
  "Руслан",
  "Діана",
  "Оксана",
  "Єва",
  "Камілла",
  "Марк",
  "Варвара",
  "Нікіта",
  "Зоряна"
];

// ----------SURNAMES----------

const surnames = [
  "Коваленко",
  "Бондаренко",
  "Ткаченко",
  "Ковальчук",
  "Шевченко",
  "Кравченко",
  "Романенко",
  "Захарченко",
  "Левченко",
  "Кузьменко",
  "Козак",
  "Мельник",
  "Шаповаленко",
  "Білоус",
  "Тимченко",
  "Бойко",
  "Ковалюк",
  "Остапенко",
  "Поляков",
  "Карпенко",
  "Клименко",
  "Федоренко",
  "Шевельов",
  "Гончаренко",
  "Литвиненко",
  "Кулик",
  "Руденко",
  "Луценко",
  "Кучеренко",
  "Матвієнко",
  "Бараненко",
  "Жуковський",
  "Косенко",
  "Тарасенко",
  "Козловський",
  "Семенченко",
  "Лихачов",
  "Бондарчук",
  "Масленко",
  "Гончарук",
  "Даниленко",
  "Гребенюк",
  "Кравчук",
  "Захарчук",
  "Ковалюк",
  "Карплюк",
  "Мельничук",
  "Литвинчук",
  "Балан",
  "Косач"
];

// ----------TALENTS----------

const talents = [
  "Спів",
  "Танці",
  "Малювання",
  "Скрипка",
  "Гра на піаніно",
  "Гра на гітарі",
  "Хореографія",
  "Акробатика",
  "Комедії",
  "Магія",
  "Гра на флейті",
  "Гра на саксофоні",
  "Поетичне виконавство",
  "Скульптура",
  "Гра на українському бандурі",
  "Гра на барабанах",
  "Живопис",
  "Театральна акторська гра",
  "Фігурне катання",
  "Стрільба з лука",
  "Створення музики",
  "Гра на гармоні",
  "Фокуси",
  "Гра на сопілці",
  "Балет",
  "Робототехніка",
  "Гра на акордеоні",
  "Льодові скульптури",
  "Тренування домашніх тварин",
  "Фрістайл",
  "Багатоголосний спів",
  "Аерографія",
  "Боді-арт",
  "Скейтбординг",
  "Магія з картами",
  "Скульптури з кераміки",
  "Малювання на склі",
  "Фігурне катання на роликах",
  "Танці з вогнем"
];

// ----------JURI----------

const juryMembers = [
  {
    name: "Євген",
    surname: "Паперний",
    role: "музичний продюсер"
  },
  {
    name: "Світлана",
    surname: "Лобода",
    role: "поп-виконавиця"
  },
  {
    name: "Владислав",
    surname: "Яма",
    role: "танцор"
  },
  {
    name: "Наталія",
    surname: "Фаліон",
    role: "танцівниця, хореограф"
  },
  {
    name: "Олексій",
    surname: "Потапенко",
    role: "музичний продюсер"
  },
  {
    name: "Сергій",
    surname: "Притула",
    role: "телеведучий, комедіант"
  },
  {
    name: "Ектор",
    surname: "Хіменес-Браво",
    role: "шеф-повар"
  },
  {
    name: "Ольга",
    surname: "Фреймут",
    role: "телеведуча, акторка"
  },
  {
    name: "Ігор",
    surname: "Кондратюк",
    role: "телеведучий, продюсер"
  },
  {
    name: "Алла",
    surname: "Костромічова",
    role: "танцівниця, хореограф"
  }
];


// ----------ALGORITHM----------


function getRandomElement(array) {
  let randomIndex = Math.floor(Math.random() * array.length);
  return array[randomIndex];
}

function getRandomProfiles(count) {
  let profiles = [];

  for (let i = 0; i < count; i++) {
    let randName = getRandomElement(names);
    let randSurname = getRandomElement(surnames);
    let randTalent = getRandomElement(talents);

    let profile = `${randName} ${randSurname} - ${randTalent}<br><br>`;
    profiles.push(profile);
  }

  return profiles.join('');
}

let participantCount = parseInt(prompt("Введіть кількість учасників (щонайменше 20):"));

while (participantCount < 20) {
  participantCount = parseInt(prompt("Кількість учасників має бути не менше 20. Будь ласка, введіть правильну кількість:"));
}

// while (participantCount > 50) {
//   participantCount = parseInt(prompt("Кількість учасників має бути не більше 50. Будь ласка, введіть правильну кількість:"));
// }

let randomProfiles = getRandomProfiles(participantCount);

document.write(randomProfiles);